app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
 def index
    @products=Product.find_product_for_sale